In [2]:
import pandas as pd
import numpy as np
from stacking import Stacking

In [3]:
df=pd.DataFrame({
    'id': [1,2,3,4],
    'name':['Andrey','?','Kostya','Aziz'],
    'age':[20,34,"?",14]
})
df
# type(df[0,col])

   id    name age
0   1  Andrey  20
1   2       ?  34
2   3  Kostya   ?
3   4    Aziz  14

In [ ]:
for col in df.columns:
    print(f"\n{col}:{df[col].dtype}")
    df[df[col]=='?']=np.nan

id:int64

name:object

age:object

In [6]:
f=df.iloc[:,:-1]
f

   id    name
0   1  Andrey
1   2       ?
2   3  Kostya
3   4    Aziz

In [32]:
df.replace('?',np.nan,inplace=True)
df

   id    name   age
0   1  Andrey  20.0
1   2     NaN  34.0
2   3  Kostya   NaN
3   4    Aziz  14.0

In [50]:
df.isna().any(axis=0)

id      False
name     True
age      True
dtype: bool

In [ ]:
a=df.columns[df.isnull().any()]

['name', 'age']

In [72]:
a=pd.DataFrame({
    'position':[1,2,3,4],
    'Name': ['Edgar','Andrey','Kostya','Aziz']
})
b=pd.DataFrame({
    'position':[1,2,3,4],
    'SurName': ['Muk','Elak','Vor','Ymar']
})
pd.concat([a,b],axis='index')

   position    Name SurName
0         1   Edgar     NaN
1         2  Andrey     NaN
2         3  Kostya     NaN
3         4    Aziz     NaN
0         1     NaN     Muk
1         2     NaN    Elak
2         3     NaN     Vor
3         4     NaN    Ymar

In [ ]:
glass_df=pd.read_csv()
Stacking()